bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romdriver.c
/**
  ******************************************************************************
  * @file    bl702l_romdriver.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2021 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
  
#include "bl702l_romdriver.h"
#include <string.h>

/** @addtogroup  BL702L_Periph_Driver
 *  @{
 */

/** @defgroup ROMDRIVER
 *  @brief ROMDRIVER common functions
 *  @{
 */

/** @defgroup ROMDRIVER_Private_Type
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Type*/

/** @defgroup ROMDRIVER_Private_Defines
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Defines */

/** @defgroup ROMDRIVER_Private_Variables
 *  @{
 */                               

/*@} end of group ROMDRIVER_Private_Variables */

/** @defgroup ROMDRIVER_Global_Variables
 *  @{
 */ 
 

uint32_t const romDriverTable[]={
    0x07020001,
    0x00000000,
    0x00000000,
    0x00000000,


    [ROM_API_INDEX_AON_Power_On_MBG]                       = (uint32_t)AON_Power_On_MBG,
    [ROM_API_INDEX_AON_Power_Off_MBG]                      = (uint32_t)AON_Power_Off_MBG,
    [ROM_API_INDEX_AON_Power_On_XTAL]                      = (uint32_t)AON_Power_On_XTAL,
    [ROM_API_INDEX_AON_Set_Xtal_CapCode]                   = (uint32_t)AON_Set_Xtal_CapCode,
    [ROM_API_INDEX_AON_Get_Xtal_CapCode]                   = (uint32_t)AON_Get_Xtal_CapCode,
    [ROM_API_INDEX_AON_Set_Xtal_CapCode_Extra]             = (uint32_t)AON_Set_Xtal_CapCode_Extra,
    [ROM_API_INDEX_AON_Power_Off_XTAL]                     = (uint32_t)AON_Power_Off_XTAL,
    [ROM_API_INDEX_AON_Power_On_BG]                        = (uint32_t)AON_Power_On_BG,
    [ROM_API_INDEX_AON_Power_Off_BG]                       = (uint32_t)AON_Power_Off_BG,
    [ROM_API_INDEX_AON_Power_On_LDO11_SOC]                 = (uint32_t)AON_Power_On_LDO11_SOC,
    [ROM_API_INDEX_AON_Power_Off_LDO11_SOC]                = (uint32_t)AON_Power_Off_LDO11_SOC,
    [ROM_API_INDEX_AON_Power_On_SFReg]                     = (uint32_t)AON_Power_On_SFReg,
    [ROM_API_INDEX_AON_Power_Off_SFReg]                    = (uint32_t)AON_Power_Off_SFReg,
    [ROM_API_INDEX_AON_Set_LDO11_SOC_Sstart_Delay]         = (uint32_t)AON_Set_LDO11_SOC_Sstart_Delay,
    [ROM_API_INDEX_AON_Set_DCDC14_Top_0]                   = (uint32_t)AON_Set_DCDC14_Top_0,
    [ROM_API_INDEX_AON_Trim_Ldo11socVoutTrim]              = (uint32_t)AON_Trim_Ldo11socVoutTrim,
    [ROM_API_INDEX_AON_Trim_Ldo14VoutTrim]                 = (uint32_t)AON_Trim_Ldo14VoutTrim,
    [ROM_API_INDEX_AON_Trim_Dcdc14VoutTrim]                = (uint32_t)AON_Trim_Dcdc14VoutTrim,

    [ROM_API_INDEX_Clock_System_Clock_Get]                 = (uint32_t)Clock_System_Clock_Get,
    [ROM_API_INDEX_Clock_Peripheral_Clock_Get]             = (uint32_t)Clock_Peripheral_Clock_Get,

    [ROM_API_INDEX_SystemCoreClockGet]                     = (uint32_t)SystemCoreClockGet,

    [ROM_API_INDEX_CPU_Get_MTimer_Clock]                   = (uint32_t)CPU_Get_MTimer_Clock,
    [ROM_API_INDEX_CPU_Get_MTimer_Counter]                 = (uint32_t)CPU_Get_MTimer_Counter,
    [ROM_API_INDEX_CPU_Get_CPU_Cycle]                      = (uint32_t)CPU_Get_CPU_Cycle,
    [ROM_API_INDEX_CPU_Get_MTimer_US]                      = (uint32_t)CPU_Get_MTimer_US,
    [ROM_API_INDEX_CPU_Get_MTimer_MS]                      = (uint32_t)CPU_Get_MTimer_MS,
    [ROM_API_INDEX_CPU_MTimer_Delay_US]                    = (uint32_t)CPU_MTimer_Delay_US,
    [ROM_API_INDEX_CPU_MTimer_Delay_MS]                    = (uint32_t)CPU_MTimer_Delay_MS,

    [ROM_API_INDEX_BL702L_Delay_US]                        = (uint32_t)BL702L_Delay_US,
    [ROM_API_INDEX_BL702L_Delay_MS]                        = (uint32_t)BL702L_Delay_MS,

    [ROM_API_INDEX_EF_Ctrl_Get_Trim_Parity]                = (uint32_t)EF_Ctrl_Get_Trim_Parity,
    [ROM_API_INDEX_EF_Ctrl_Read_Common_Trim]               = (uint32_t)EF_Ctrl_Read_Common_Trim,
    [ROM_API_INDEX_EF_Ctrl_Write_Common_Trim]              = (uint32_t)EF_Ctrl_Write_Common_Trim,
    [ROM_API_INDEX_EF_Ctrl_Is_MAC_Address_Slot_Empty]      = (uint32_t)EF_Ctrl_Is_MAC_Address_Slot_Empty,
    [ROM_API_INDEX_EF_Ctrl_Write_MAC_Address_Opt]          = (uint32_t)EF_Ctrl_Write_MAC_Address_Opt,
    [ROM_API_INDEX_EF_Ctrl_Read_MAC_Address_Opt]           = (uint32_t)EF_Ctrl_Read_MAC_Address_Opt,
    [ROM_API_INDEX_EF_Ctrl_Sw_AHB_Clk_0]                   = (uint32_t)EF_Ctrl_Sw_AHB_Clk_0,
    [ROM_API_INDEX_EF_Ctrl_Program_Efuse_0]                = (uint32_t)EF_Ctrl_Program_Efuse_0,
    [ROM_API_INDEX_EF_Ctrl_Load_Efuse_R0]                  = (uint32_t)EF_Ctrl_Load_Efuse_R0,
    [ROM_API_INDEX_EF_Ctrl_Busy]                           = (uint32_t)EF_Ctrl_Busy,
    [ROM_API_INDEX_EF_Ctrl_AutoLoad_Done]                  = (uint32_t)EF_Ctrl_AutoLoad_Done,
    [ROM_API_INDEX_EF_Ctrl_Write_Dbg_Pwd]                  = (uint32_t)EF_Ctrl_Write_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Read_Dbg_Pwd]                   = (uint32_t)EF_Ctrl_Read_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Readlock_Dbg_Pwd]               = (uint32_t)EF_Ctrl_Readlock_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Writelock_Dbg_Pwd]              = (uint32_t)EF_Ctrl_Writelock_Dbg_Pwd,
    [ROM_API_INDEX_EF_Ctrl_Write_Secure_Cfg]               = (uint32_t)EF_Ctrl_Write_Secure_Cfg,
    [ROM_API_INDEX_EF_Ctrl_Read_Secure_Cfg]                = (uint32_t)EF_Ctrl_Read_Secure_Cfg,
    [ROM_API_INDEX_EF_Ctrl_Write_Secure_Boot]              = (uint32_t)EF_Ctrl_Write_Secure_Boot,
    [ROM_API_INDEX_EF_Ctrl_Read_Secure_Boot]               = (uint32_t)EF_Ctrl_Read_Secure_Boot,
    [ROM_API_INDEX_EF_Ctrl_Write_Sw_Usage]                 = (uint32_t)EF_Ctrl_Write_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Read_Sw_Usage]                  = (uint32_t)EF_Ctrl_Read_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Writelock_Sw_Usage]             = (uint32_t)EF_Ctrl_Writelock_Sw_Usage,
    [ROM_API_INDEX_EF_Ctrl_Write_MAC_Address]              = (uint32_t)EF_Ctrl_Write_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Get_Byte_Zero_Cnt]              = (uint32_t)EF_Ctrl_Get_Byte_Zero_Cnt,
    [ROM_API_INDEX_EF_Ctrl_Is_All_Bits_Zero]               = (uint32_t)EF_Ctrl_Is_All_Bits_Zero,
    [ROM_API_INDEX_EF_Ctrl_Read_MAC_Address]               = (uint32_t)EF_Ctrl_Read_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Writelock_MAC_Address]          = (uint32_t)EF_Ctrl_Writelock_MAC_Address,
    [ROM_API_INDEX_EF_Ctrl_Read_Chip_ID]                   = (uint32_t)EF_Ctrl_Read_Chip_ID,
    [ROM_API_INDEX_EF_Ctrl_Read_Device_Info]               = (uint32_t)EF_Ctrl_Read_Device_Info,
    [ROM_API_INDEX_EF_Ctrl_Is_CapCode_Empty]               = (uint32_t)EF_Ctrl_Is_CapCode_Empty,
    [ROM_API_INDEX_EF_Ctrl_Write_CapCode_Opt]              = (uint32_t)EF_Ctrl_Write_CapCode_Opt,
    [ROM_API_INDEX_EF_Ctrl_Read_CapCode_Opt]               = (uint32_t)EF_Ctrl_Read_CapCode_Opt,
    [ROM_API_INDEX_EF_Ctrl_Is_PowerOffset_Slot_Empty]      = (uint32_t)EF_Ctrl_Is_PowerOffset_Slot_Empty,
    [ROM_API_INDEX_EF_Ctrl_Write_PowerOffset_Opt]          = (uint32_t)EF_Ctrl_Write_PowerOffset_Opt,
    [ROM_API_INDEX_EF_Ctrl_Read_PowerOffset_Opt]           = (uint32_t)EF_Ctrl_Read_PowerOffset_Opt,
    [ROM_API_INDEX_EF_Ctrl_Write_AES_Key]                  = (uint32_t)EF_Ctrl_Write_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Read_AES_Key]                   = (uint32_t)EF_Ctrl_Read_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Writelock_AES_Key]              = (uint32_t)EF_Ctrl_Writelock_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Readlock_AES_Key]               = (uint32_t)EF_Ctrl_Readlock_AES_Key,
    [ROM_API_INDEX_EF_Ctrl_Program_Direct_R0]              = (uint32_t)EF_Ctrl_Program_Direct_R0,
    [ROM_API_INDEX_EF_Ctrl_Read_Direct_R0]                 = (uint32_t)EF_Ctrl_Read_Direct_R0,
    [ROM_API_INDEX_EF_Ctrl_Clear]                          = (uint32_t)EF_Ctrl_Clear,
    [ROM_API_INDEX_EF_Ctrl_Crc_Enable]                     = (uint32_t)EF_Ctrl_Crc_Enable,
    [ROM_API_INDEX_EF_Ctrl_Crc_Is_Busy]                    = (uint32_t)EF_Ctrl_Crc_Is_Busy,
    [ROM_API_INDEX_EF_Ctrl_Crc_Set_Golden]                 = (uint32_t)EF_Ctrl_Crc_Set_Golden,
    [ROM_API_INDEX_EF_Ctrl_Crc_Result]                     = (uint32_t)EF_Ctrl_Crc_Result,

