bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romdriver.c
    [ROM_API_INDEX_GLB_Get_Root_CLK_Sel]                   = (uint32_t)GLB_Get_Root_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_System_CLK_Div]                 = (uint32_t)GLB_Set_System_CLK_Div,
    [ROM_API_INDEX_GLB_Get_BCLK_Div]                       = (uint32_t)GLB_Get_BCLK_Div,
    [ROM_API_INDEX_GLB_Get_HCLK_Div]                       = (uint32_t)GLB_Get_HCLK_Div,
    [ROM_API_INDEX_GLB_Set_System_CLK]                     = (uint32_t)GLB_Set_System_CLK,

    [ROM_API_INDEX_System_Core_Clock_Update_From_RC32M]    = (uint32_t)System_Core_Clock_Update_From_RC32M,

    [ROM_API_INDEX_GLB_Set_MAC154_ZIGBEE_CLK]              = (uint32_t)GLB_Set_MAC154_ZIGBEE_CLK,
    [ROM_API_INDEX_GLB_Set_BLE_CLK]                        = (uint32_t)GLB_Set_BLE_CLK,
    [ROM_API_INDEX_GLB_Set_AUDIO_CLK]                      = (uint32_t)GLB_Set_AUDIO_CLK,
    [ROM_API_INDEX_GLB_Set_KYS_CLK]                        = (uint32_t)GLB_Set_KYS_CLK,
    [ROM_API_INDEX_GLB_Set_DMA_CLK]                        = (uint32_t)GLB_Set_DMA_CLK,
    [ROM_API_INDEX_GLB_Set_IR_CLK]                         = (uint32_t)GLB_Set_IR_CLK,
    [ROM_API_INDEX_GLB_Set_SF_CLK]                         = (uint32_t)GLB_Set_SF_CLK,
    [ROM_API_INDEX_GLB_Set_UART_CLK]                       = (uint32_t)GLB_Set_UART_CLK,
    [ROM_API_INDEX_GLB_Sel_TMR_GPIO_Clock]                 = (uint32_t)GLB_Sel_TMR_GPIO_Clock,
    [ROM_API_INDEX_GLB_Set_Chip_Out_0_CLK_Sel]             = (uint32_t)GLB_Set_Chip_Out_0_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_Chip_Out_1_CLK_Sel]             = (uint32_t)GLB_Set_Chip_Out_1_CLK_Sel,
    [ROM_API_INDEX_GLB_Set_Chip_Out_0_CLK_Enable]          = (uint32_t)GLB_Set_Chip_Out_0_CLK_Enable,
    [ROM_API_INDEX_GLB_Set_Chip_Out_1_CLK_Enable]          = (uint32_t)GLB_Set_Chip_Out_1_CLK_Enable,
    [ROM_API_INDEX_GLB_Set_I2C_CLK]                        = (uint32_t)GLB_Set_I2C_CLK,
    [ROM_API_INDEX_GLB_Set_SPI_CLK]                        = (uint32_t)GLB_Set_SPI_CLK,
    [ROM_API_INDEX_GLB_Set_PKA_CLK_Sel]                    = (uint32_t)GLB_Set_PKA_CLK_Sel,
    [ROM_API_INDEX_GLB_SW_System_Reset]                    = (uint32_t)GLB_SW_System_Reset,
    [ROM_API_INDEX_GLB_SW_CPU_Reset]                       = (uint32_t)GLB_SW_CPU_Reset,
    [ROM_API_INDEX_GLB_SW_POR_Reset]                       = (uint32_t)GLB_SW_POR_Reset,
    [ROM_API_INDEX_GLB_AHB_MCU_Software_Reset]             = (uint32_t)GLB_AHB_MCU_Software_Reset,
    [ROM_API_INDEX_GLB_Disrst_Set]                         = (uint32_t)GLB_Disrst_Set,
    [ROM_API_INDEX_GLB_MAC154_ZIGBEE_Reset]                = (uint32_t)GLB_MAC154_ZIGBEE_Reset,
    [ROM_API_INDEX_GLB_BLE_Reset]                          = (uint32_t)GLB_BLE_Reset,
    [ROM_API_INDEX_GLB_PER_Clock_Gate]                     = (uint32_t)GLB_PER_Clock_Gate,
    [ROM_API_INDEX_GLB_PER_Clock_UnGate]                   = (uint32_t)GLB_PER_Clock_UnGate,
    [ROM_API_INDEX_GLB_Set_RTC_Mode]                       = (uint32_t)GLB_Set_RTC_Mode,
    [ROM_API_INDEX_GLB_BMX_Init]                           = (uint32_t)GLB_BMX_Init,
    [ROM_API_INDEX_GLB_BMX_Addr_Monitor_Enable]            = (uint32_t)GLB_BMX_Addr_Monitor_Enable,
    [ROM_API_INDEX_GLB_BMX_Addr_Monitor_Disable]           = (uint32_t)GLB_BMX_Addr_Monitor_Disable,
    [ROM_API_INDEX_GLB_BMX_BusErrResponse_Enable]          = (uint32_t)GLB_BMX_BusErrResponse_Enable,
    [ROM_API_INDEX_GLB_BMX_BusErrResponse_Disable]         = (uint32_t)GLB_BMX_BusErrResponse_Disable,
    [ROM_API_INDEX_GLB_BMX_Get_Status]                     = (uint32_t)GLB_BMX_Get_Status,
    [ROM_API_INDEX_GLB_BMX_Get_Err_Addr]                   = (uint32_t)GLB_BMX_Get_Err_Addr,
    [ROM_API_INDEX_GLB_BMX_BusErrClr_Set]                  = (uint32_t)GLB_BMX_BusErrClr_Set,
    [ROM_API_INDEX_GLB_Set_SRAM_PARM]                      = (uint32_t)GLB_Set_SRAM_PARM,
    [ROM_API_INDEX_GLB_Get_SRAM_PARM]                      = (uint32_t)GLB_Get_SRAM_PARM,
    [ROM_API_INDEX_GLB_Set_OCRAM_PARM]                     = (uint32_t)GLB_Set_OCRAM_PARM,
    [ROM_API_INDEX_GLB_Get_OCRAM_PARM]                     = (uint32_t)GLB_Get_OCRAM_PARM,
    [ROM_API_INDEX_GLB_Set_EM_Sel]                         = (uint32_t)GLB_Set_EM_Sel,
    [ROM_API_INDEX_GLB_Set_Kys_Drv_Col]                    = (uint32_t)GLB_Set_Kys_Drv_Col,
    [ROM_API_INDEX_GLB_GPIO_O_Latch_Mode_Set]              = (uint32_t)GLB_GPIO_O_Latch_Mode_Set,
    [ROM_API_INDEX_GLB_JTAG_Sig_Swap_Set]                  = (uint32_t)GLB_JTAG_Sig_Swap_Set,
    [ROM_API_INDEX_GLB_CCI_Use_IO_0_1_2_7]                 = (uint32_t)GLB_CCI_Use_IO_0_1_2_7,
    [ROM_API_INDEX_GLB_CCI_Use_Jtag_Pin]                   = (uint32_t)GLB_CCI_Use_Jtag_Pin,
    [ROM_API_INDEX_GLB_Swap_SPI_0_MOSI_With_MISO]          = (uint32_t)GLB_Swap_SPI_0_MOSI_With_MISO,
    [ROM_API_INDEX_GLB_Set_SPI_0_ACT_MOD_Sel]              = (uint32_t)GLB_Set_SPI_0_ACT_MOD_Sel,
    [ROM_API_INDEX_GLB_Set_Flash_Scenario]                 = (uint32_t)GLB_Set_Flash_Scenario,
    [ROM_API_INDEX_GLB_Set_Embedded_FLash_IO_PARM]         = (uint32_t)GLB_Set_Embedded_FLash_IO_PARM,
    [ROM_API_INDEX_GLB_Set_MTimer_CLK]                     = (uint32_t)GLB_Set_MTimer_CLK,
    [ROM_API_INDEX_GLB_Set_ADC_CLK]                        = (uint32_t)GLB_Set_ADC_CLK,
    [ROM_API_INDEX_GLB_Set_DIG_32K_CLK]                    = (uint32_t)GLB_Set_DIG_32K_CLK,
    [ROM_API_INDEX_GLB_SW_BLE_WAKEUP_REQ_Set]              = (uint32_t)GLB_SW_BLE_WAKEUP_REQ_Set,
    [ROM_API_INDEX_GLB_UART_Fun_Sel]                       = (uint32_t)GLB_UART_Fun_Sel,
    [ROM_API_INDEX_GLB_Power_Off_DLL]                      = (uint32_t)GLB_Power_Off_DLL,
    [ROM_API_INDEX_GLB_Power_On_DLL]                       = (uint32_t)GLB_Power_On_DLL,
    [ROM_API_INDEX_GLB_Enable_DLL_All_Clks]                = (uint32_t)GLB_Enable_DLL_All_Clks,
    [ROM_API_INDEX_GLB_Enable_DLL_Clk]                     = (uint32_t)GLB_Enable_DLL_Clk,
    [ROM_API_INDEX_GLB_Disable_DLL_All_Clks]               = (uint32_t)GLB_Disable_DLL_All_Clks,
    [ROM_API_INDEX_GLB_Disable_DLL_Clk]                    = (uint32_t)GLB_Disable_DLL_Clk,
    [ROM_API_INDEX_GLB_Set_Flash_Id_Value]                 = (uint32_t)GLB_Set_Flash_Id_Value,
    [ROM_API_INDEX_GLB_Get_Flash_Id_Value]                 = (uint32_t)GLB_Get_Flash_Id_Value,
    [ROM_API_INDEX_GLB_Trim_RC32M]                         = (uint32_t)GLB_Trim_RC32M,
    [ROM_API_INDEX_GLB_Set_Xtal_Cnt32k_Process]            = (uint32_t)GLB_Set_Xtal_Cnt32k_Process,
    [ROM_API_INDEX_GLB_Clear_Xtal_Cnt32k_Done]             = (uint32_t)GLB_Clear_Xtal_Cnt32k_Done,
    [ROM_API_INDEX_GLB_RC32K_Deg_Start]                    = (uint32_t)GLB_RC32K_Deg_Start,
    [ROM_API_INDEX_GLB_RC32K_Deg_End]                      = (uint32_t)GLB_RC32K_Deg_End,
    [ROM_API_INDEX_GLB_RC32K_Deg_Enable]                   = (uint32_t)GLB_RC32K_Deg_Enable,
    [ROM_API_INDEX_GLB_Xtal_Deg_Cnt_Limit_Set]             = (uint32_t)GLB_Xtal_Deg_Cnt_Limit_Set,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Enable]               = (uint32_t)GLB_IR_LED_Driver_Enable,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Disable]              = (uint32_t)GLB_IR_LED_Driver_Disable,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Output_Enable]        = (uint32_t)GLB_IR_LED_Driver_Output_Enable,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Output_Disable]       = (uint32_t)GLB_IR_LED_Driver_Output_Disable,
    [ROM_API_INDEX_GLB_IR_LED_Driver_Ibias]                = (uint32_t)GLB_IR_LED_Driver_Ibias,
    [ROM_API_INDEX_GLB_GPIO_Init]                          = (uint32_t)GLB_GPIO_Init,
    [ROM_API_INDEX_GLB_GPIO_Func_Init]                     = (uint32_t)GLB_GPIO_Func_Init,
    [ROM_API_INDEX_GLB_GPIO_OUTPUT_Mode_Set]               = (uint32_t)GLB_GPIO_OUTPUT_Mode_Set,
    [ROM_API_INDEX_GLB_GPIO_INPUT_Enable]                  = (uint32_t)GLB_GPIO_INPUT_Enable,
    [ROM_API_INDEX_GLB_GPIO_INPUT_Disable]                 = (uint32_t)GLB_GPIO_INPUT_Disable,
    [ROM_API_INDEX_GLB_GPIO_OUTPUT_Enable]                 = (uint32_t)GLB_GPIO_OUTPUT_Enable,
    [ROM_API_INDEX_GLB_GPIO_OUTPUT_Disable]                = (uint32_t)GLB_GPIO_OUTPUT_Disable,
    [ROM_API_INDEX_GLB_GPIO_Set_HZ]                        = (uint32_t)GLB_GPIO_Set_HZ,
    [ROM_API_INDEX_GLB_GPIO_Get_Fun]                       = (uint32_t)GLB_GPIO_Get_Fun,
    [ROM_API_INDEX_GLB_GPIO_Write]                         = (uint32_t)GLB_GPIO_Write,
    [ROM_API_INDEX_GLB_GPIO_Read]                          = (uint32_t)GLB_GPIO_Read,
    [ROM_API_INDEX_GLB_GPIO_Set]                           = (uint32_t)GLB_GPIO_Set,
    [ROM_API_INDEX_GLB_GPIO_Clr]                           = (uint32_t)GLB_GPIO_Clr,
    [ROM_API_INDEX_GLB_GPIO_IntMask]                       = (uint32_t)GLB_GPIO_IntMask,
    [ROM_API_INDEX_GLB_Clr_GPIO_IntStatus]                 = (uint32_t)GLB_Clr_GPIO_IntStatus,
    [ROM_API_INDEX_GLB_Get_GPIO_IntStatus]                 = (uint32_t)GLB_Get_GPIO_IntStatus,
    [ROM_API_INDEX_GLB_GPIO_Int_Init]                      = (uint32_t)GLB_GPIO_Int_Init,

    [ROM_API_INDEX_HBN_Mode_Enter]                         = (uint32_t)HBN_Mode_Enter,
    [ROM_API_INDEX_HBN_GPIO_Wakeup_Set]                    = (uint32_t)HBN_GPIO_Wakeup_Set,
    [ROM_API_INDEX_HBN_Power_Down_Flash]                   = (uint32_t)HBN_Power_Down_Flash,
    [ROM_API_INDEX_HBN_Enable]                             = (uint32_t)HBN_Enable,
    [ROM_API_INDEX_HBN_Reset]                              = (uint32_t)HBN_Reset,
    [ROM_API_INDEX_HBN_App_Reset]                          = (uint32_t)HBN_App_Reset,
    [ROM_API_INDEX_HBN_Disable]                            = (uint32_t)HBN_Disable,
    [ROM_API_INDEX_HBN_Get_BOR_OUT_State]                  = (uint32_t)HBN_Get_BOR_OUT_State,
    [ROM_API_INDEX_HBN_Set_BOR_Config]                     = (uint32_t)HBN_Set_BOR_Config,
    [ROM_API_INDEX_HBN_Set_Ldo11_Aon_Vout]                 = (uint32_t)HBN_Set_Ldo11_Aon_Vout,
    [ROM_API_INDEX_HBN_Set_Ldo11_Soc_Vout]                 = (uint32_t)HBN_Set_Ldo11_Soc_Vout,
    [ROM_API_INDEX_HBN_Set_Ldo11_All_Vout]                 = (uint32_t)HBN_Set_Ldo11_All_Vout,
    [ROM_API_INDEX_HBN_32K_Sel]                            = (uint32_t)HBN_32K_Sel,
    [ROM_API_INDEX_HBN_Set_UART_CLK_Sel]                   = (uint32_t)HBN_Set_UART_CLK_Sel,
    [ROM_API_INDEX_HBN_Set_XCLK_CLK_Sel]                   = (uint32_t)HBN_Set_XCLK_CLK_Sel,
    [ROM_API_INDEX_HBN_Set_ROOT_CLK_Sel]                   = (uint32_t)HBN_Set_ROOT_CLK_Sel,
    [ROM_API_INDEX_HBN_Set_HRAM_slp]                       = (uint32_t)HBN_Set_HRAM_slp,
    [ROM_API_INDEX_HBN_Set_HRAM_Ret]                       = (uint32_t)HBN_Set_HRAM_Ret,
    [ROM_API_INDEX_HBN_Power_On_Xtal_32K]                  = (uint32_t)HBN_Power_On_Xtal_32K,
    [ROM_API_INDEX_HBN_Power_Off_Xtal_32K]                 = (uint32_t)HBN_Power_Off_Xtal_32K,
    [ROM_API_INDEX_HBN_Power_On_RC32K]                     = (uint32_t)HBN_Power_On_RC32K,
    [ROM_API_INDEX_HBN_Power_Off_RC32K]                    = (uint32_t)HBN_Power_Off_RC32K,
    [ROM_API_INDEX_HBN_Trim_RC32K]                         = (uint32_t)HBN_Trim_RC32K,
    [ROM_API_INDEX_HBN_Get_Status_Flag]                    = (uint32_t)HBN_Get_Status_Flag,
    [ROM_API_INDEX_HBN_Set_Status_Flag]                    = (uint32_t)HBN_Set_Status_Flag,
    [ROM_API_INDEX_HBN_Get_Wakeup_Addr]                    = (uint32_t)HBN_Get_Wakeup_Addr,
    [ROM_API_INDEX_HBN_Set_Wakeup_Addr]                    = (uint32_t)HBN_Set_Wakeup_Addr,
    [ROM_API_INDEX_HBN_Get_User_Boot_Config]               = (uint32_t)HBN_Get_User_Boot_Config,
    [ROM_API_INDEX_HBN_Set_User_Boot_Config]               = (uint32_t)HBN_Set_User_Boot_Config,
    [ROM_API_INDEX_HBN_Clear_RTC_Counter]                  = (uint32_t)HBN_Clear_RTC_Counter,
    [ROM_API_INDEX_HBN_Enable_RTC_Counter]                 = (uint32_t)HBN_Enable_RTC_Counter,
    [ROM_API_INDEX_HBN_Set_RTC_Timer]                      = (uint32_t)HBN_Set_RTC_Timer,
    [ROM_API_INDEX_HBN_Get_RTC_Timer_Val]                  = (uint32_t)HBN_Get_RTC_Timer_Val,
    [ROM_API_INDEX_HBN_Clear_RTC_INT]                      = (uint32_t)HBN_Clear_RTC_INT,
    [ROM_API_INDEX_HBN_GPIO_INT_Enable]                    = (uint32_t)HBN_GPIO_INT_Enable,
    [ROM_API_INDEX_HBN_GPIO_INT_Disable]                   = (uint32_t)HBN_GPIO_INT_Disable,
    [ROM_API_INDEX_HBN_Get_INT_State]                      = (uint32_t)HBN_Get_INT_State,
    [ROM_API_INDEX_HBN_Get_Pin_Wakeup_Mode]                = (uint32_t)HBN_Get_Pin_Wakeup_Mode,
    [ROM_API_INDEX_HBN_Clear_IRQ]                          = (uint32_t)HBN_Clear_IRQ,
    [ROM_API_INDEX_HBN_Hw_Pu_Pd_Cfg]                       = (uint32_t)HBN_Hw_Pu_Pd_Cfg,
    [ROM_API_INDEX_HBN_Comm_Pad_Wakeup_En_Cfg]             = (uint32_t)HBN_Comm_Pad_Wakeup_En_Cfg,
    [ROM_API_INDEX_HBN_Aon_Pad_IeSmt_Cfg]                  = (uint32_t)HBN_Aon_Pad_IeSmt_Cfg,
    [ROM_API_INDEX_HBN_Pin_WakeUp_Mask]                    = (uint32_t)HBN_Pin_WakeUp_Mask,
    [ROM_API_INDEX_HBN_Enable_AComp0_IRQ]                  = (uint32_t)HBN_Enable_AComp0_IRQ,
    [ROM_API_INDEX_HBN_Disable_AComp0_IRQ]                 = (uint32_t)HBN_Disable_AComp0_IRQ,
    [ROM_API_INDEX_HBN_Enable_AComp1_IRQ]                  = (uint32_t)HBN_Enable_AComp1_IRQ,
    [ROM_API_INDEX_HBN_Disable_AComp1_IRQ]                 = (uint32_t)HBN_Disable_AComp1_IRQ,
    [ROM_API_INDEX_HBN_Enable_BOR_IRQ]                     = (uint32_t)HBN_Enable_BOR_IRQ,
    [ROM_API_INDEX_HBN_Disable_BOR_IRQ]                    = (uint32_t)HBN_Disable_BOR_IRQ,
    [ROM_API_INDEX_HBN_Get_Reset_Event]                    = (uint32_t)HBN_Get_Reset_Event,
    [ROM_API_INDEX_HBN_Clear_Reset_Event]                  = (uint32_t)HBN_Clear_Reset_Event,
    [ROM_API_INDEX_HBN_GPIO_Dbg_Pull_Cfg]                  = (uint32_t)HBN_GPIO_Dbg_Pull_Cfg,
    [ROM_API_INDEX_HBN_Set_BOR_Cfg]                        = (uint32_t)HBN_Set_BOR_Cfg,

    [ROM_API_INDEX_L1C_Cache_Write_Set]                    = (uint32_t)L1C_Cache_Write_Set,
    [ROM_API_INDEX_L1C_Cache_Enable_Set]                   = (uint32_t)L1C_Cache_Enable_Set,
    [ROM_API_INDEX_L1C_Cache_Flush]                        = (uint32_t)L1C_Cache_Flush,
    [ROM_API_INDEX_L1C_Cache_Hit_Count_Get]                = (uint32_t)L1C_Cache_Hit_Count_Get,
    [ROM_API_INDEX_L1C_Cache_Miss_Count_Get]               = (uint32_t)L1C_Cache_Miss_Count_Get,
    [ROM_API_INDEX_L1C_Cache_Read_Disable]                 = (uint32_t)L1C_Cache_Read_Disable,
    [ROM_API_INDEX_L1C_Set_Wrap]                           = (uint32_t)L1C_Set_Wrap,
    [ROM_API_INDEX_L1C_Set_Way_Disable]                    = (uint32_t)L1C_Set_Way_Disable,
    [ROM_API_INDEX_L1C_IROM_2T_Access_Set]                 = (uint32_t)L1C_IROM_2T_Access_Set,
    [ROM_API_INDEX_L1C_BMX_Init]                           = (uint32_t)L1C_BMX_Init,
    [ROM_API_INDEX_L1C_BMX_Addr_Monitor_Enable]            = (uint32_t)L1C_BMX_Addr_Monitor_Enable,
    [ROM_API_INDEX_L1C_BMX_Addr_Monitor_Disable]           = (uint32_t)L1C_BMX_Addr_Monitor_Disable,
    [ROM_API_INDEX_L1C_BMX_BusErrResponse_Enable]          = (uint32_t)L1C_BMX_BusErrResponse_Enable,
    [ROM_API_INDEX_L1C_BMX_BusErrResponse_Disable]         = (uint32_t)L1C_BMX_BusErrResponse_Disable,
    [ROM_API_INDEX_L1C_BMX_Get_Status]                     = (uint32_t)L1C_BMX_Get_Status,
    [ROM_API_INDEX_L1C_BMX_Get_Err_Addr]                   = (uint32_t)L1C_BMX_Get_Err_Addr,

    [ROM_API_INDEX_PDS_Set_GPIO_Pad_Cfg]                   = (uint32_t)PDS_Set_GPIO_Pad_Cfg,
    [ROM_API_INDEX_PDS_GPIO_Write]                         = (uint32_t)PDS_GPIO_Write,
    [ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMask]               = (uint32_t)PDS_Set_GPIO_Pad_IntMask,
    [ROM_API_INDEX_PDS_Set_GPIO_Pad_IntMode]               = (uint32_t)PDS_Set_GPIO_Pad_IntMode,
    [ROM_API_INDEX_PDS_Set_GPIO_Pad_IntClr]                = (uint32_t)PDS_Set_GPIO_Pad_IntClr,
    [ROM_API_INDEX_PDS_Set_All_GPIO_IntClear]              = (uint32_t)PDS_Set_All_GPIO_IntClear,
    [ROM_API_INDEX_PDS_Get_GPIO_Pad_IntStatus]             = (uint32_t)PDS_Get_GPIO_Pad_IntStatus,
    [ROM_API_INDEX_PDS_Disable_GPIO_Keep]                  = (uint32_t)PDS_Disable_GPIO_Keep,
    [ROM_API_INDEX_PDS_Enable]                             = (uint32_t)PDS_Enable,
    [ROM_API_INDEX_PDS_Force_Config]                       = (uint32_t)PDS_Force_Config,
    [ROM_API_INDEX_PDS_RAM_Config]                         = (uint32_t)PDS_RAM_Config,
    [ROM_API_INDEX_PDS_Default_Level_Config]               = (uint32_t)PDS_Default_Level_Config,
    [ROM_API_INDEX_PDS_Wakeup_Src_En]                      = (uint32_t)PDS_Wakeup_Src_En,
    [ROM_API_INDEX_PDS_Get_Wakeup_Src]                     = (uint32_t)PDS_Get_Wakeup_Src,
    [ROM_API_INDEX_PDS_IntMask]                            = (uint32_t)PDS_IntMask,
    [ROM_API_INDEX_PDS_Get_IntStatus]                      = (uint32_t)PDS_Get_IntStatus,
    [ROM_API_INDEX_PDS_IntClear]                           = (uint32_t)PDS_IntClear,
    [ROM_API_INDEX_PDS_Get_PdsRfStstus]                    = (uint32_t)PDS_Get_PdsRfStstus,
    [ROM_API_INDEX_PDS_Get_PdsStstus]                      = (uint32_t)PDS_Get_PdsStstus,
    [ROM_API_INDEX_PDS_Clear_Reset_Event]                  = (uint32_t)PDS_Clear_Reset_Event,
    [ROM_API_INDEX_PDS_Get_Reset_Event]                    = (uint32_t)PDS_Get_Reset_Event,
    [ROM_API_INDEX_PDS_Auto_Enable]                        = (uint32_t)PDS_Auto_Enable,
    [ROM_API_INDEX_PDS_Manual_Force_Turn_Off]              = (uint32_t)PDS_Manual_Force_Turn_Off,
    [ROM_API_INDEX_PDS_Manual_Force_Turn_On]               = (uint32_t)PDS_Manual_Force_Turn_On,
    [ROM_API_INDEX_PDS_Set_KYD_Matrix_Size]                = (uint32_t)PDS_Set_KYD_Matrix_Size,
    [ROM_API_INDEX_PDS_Set_KYD_Col_Value]                  = (uint32_t)PDS_Set_KYD_Col_Value,
    [ROM_API_INDEX_PDS_Set_KYD_Row_Pull]                   = (uint32_t)PDS_Set_KYD_Row_Pull,
    [ROM_API_INDEX_PDS_Set_KYD_Wakeup_En]                  = (uint32_t)PDS_Set_KYD_Wakeup_En,

    [ROM_API_INDEX_SF_Cfg_Init_Internal_Flash_Gpio]        = (uint32_t)SF_Cfg_Init_Internal_Flash_Gpio,
    [ROM_API_INDEX_SF_Cfg_Init_Ext_Flash_Gpio]             = (uint32_t)SF_Cfg_Init_Ext_Flash_Gpio,
    [ROM_API_INDEX_SF_Cfg_Deinit_Ext_Flash_Gpio]           = (uint32_t)SF_Cfg_Deinit_Ext_Flash_Gpio,
    [ROM_API_INDEX_SF_Cfg_Get_Flash_Cfg_Need_Lock]         = (uint32_t)SF_Cfg_Get_Flash_Cfg_Need_Lock,
    [ROM_API_INDEX_SF_Cfg_Init_Flash_Gpio]                 = (uint32_t)SF_Cfg_Init_Flash_Gpio,
    [ROM_API_INDEX_SF_Cfg_Flash_Identify]                  = (uint32_t)SF_Cfg_Flash_Identify,
    [ROM_API_INDEX_SF_Ctrl_Enable]                         = (uint32_t)SF_Ctrl_Enable,
    [ROM_API_INDEX_SF_Ctrl_Psram_Init]                     = (uint32_t)SF_Ctrl_Psram_Init,
    [ROM_API_INDEX_SF_Ctrl_Get_Clock_Delay]                = (uint32_t)SF_Ctrl_Get_Clock_Delay,
    [ROM_API_INDEX_SF_Ctrl_Set_Clock_Delay]                = (uint32_t)SF_Ctrl_Set_Clock_Delay,
    [ROM_API_INDEX_SF_Ctrl_Cmds_Set]                       = (uint32_t)SF_Ctrl_Cmds_Set,
    [ROM_API_INDEX_SF_Ctrl_Burst_Toggle_Set]               = (uint32_t)SF_Ctrl_Burst_Toggle_Set,
    [ROM_API_INDEX_SF_Ctrl_Select_Pad]                     = (uint32_t)SF_Ctrl_Select_Pad,
    [ROM_API_INDEX_SF_Ctrl_Select_Bank]                    = (uint32_t)SF_Ctrl_Select_Bank,
    [ROM_API_INDEX_SF_Ctrl_Set_Owner]                      = (uint32_t)SF_Ctrl_Set_Owner,
    [ROM_API_INDEX_SF_Ctrl_Disable]                        = (uint32_t)SF_Ctrl_Disable,
    [ROM_API_INDEX_SF_Ctrl_AES_Enable_BE]                  = (uint32_t)SF_Ctrl_AES_Enable_BE,
    [ROM_API_INDEX_SF_Ctrl_AES_Enable_LE]                  = (uint32_t)SF_Ctrl_AES_Enable_LE,
    [ROM_API_INDEX_SF_Ctrl_AES_Set_Region]                 = (uint32_t)SF_Ctrl_AES_Set_Region,
    [ROM_API_INDEX_SF_Ctrl_AES_Set_Key]                    = (uint32_t)SF_Ctrl_AES_Set_Key,
    [ROM_API_INDEX_SF_Ctrl_AES_Set_Key_BE]                 = (uint32_t)SF_Ctrl_AES_Set_Key_BE,
    [ROM_API_INDEX_SF_Ctrl_AES_Set_IV]                     = (uint32_t)SF_Ctrl_AES_Set_IV,
    [ROM_API_INDEX_SF_Ctrl_AES_Set_IV_BE]                  = (uint32_t)SF_Ctrl_AES_Set_IV_BE,
    [ROM_API_INDEX_SF_Ctrl_AES_Enable]                     = (uint32_t)SF_Ctrl_AES_Enable,
    [ROM_API_INDEX_SF_Ctrl_AES_Disable]                    = (uint32_t)SF_Ctrl_AES_Disable,
    [ROM_API_INDEX_SF_Ctrl_Is_AES_Enable]                  = (uint32_t)SF_Ctrl_Is_AES_Enable,
    [ROM_API_INDEX_SF_Ctrl_Set_Flash_Image_Offset]         = (uint32_t)SF_Ctrl_Set_Flash_Image_Offset,
    [ROM_API_INDEX_SF_Ctrl_Get_Flash_Image_Offset]         = (uint32_t)SF_Ctrl_Get_Flash_Image_Offset,
    [ROM_API_INDEX_SF_Ctrl_SendCmd]                        = (uint32_t)SF_Ctrl_SendCmd,
    [ROM_API_INDEX_SF_Ctrl_Flash_Read_Icache_Set]          = (uint32_t)SF_Ctrl_Flash_Read_Icache_Set,
    [ROM_API_INDEX_SF_Ctrl_Psram_Write_Icache_Set]         = (uint32_t)SF_Ctrl_Psram_Write_Icache_Set,
    [ROM_API_INDEX_SF_Ctrl_Psram_Read_Icache_Set]          = (uint32_t)SF_Ctrl_Psram_Read_Icache_Set,
    [ROM_API_INDEX_SF_Ctrl_GetBusyState]                   = (uint32_t)SF_Ctrl_GetBusyState,

