bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romdriver.c
    [ROM_API_INDEX_SFlash_Init]                            = (uint32_t)SFlash_Init,
    [ROM_API_INDEX_SFlash_SetSPIMode]                      = (uint32_t)SFlash_SetSPIMode,
    [ROM_API_INDEX_SFlash_Read_Reg]                        = (uint32_t)SFlash_Read_Reg,
    [ROM_API_INDEX_SFlash_Write_Reg]                       = (uint32_t)SFlash_Write_Reg,
    [ROM_API_INDEX_SFlash_Read_Reg_With_Cmd]               = (uint32_t)SFlash_Read_Reg_With_Cmd,
    [ROM_API_INDEX_SFlash_Write_Reg_With_Cmd]              = (uint32_t)SFlash_Write_Reg_With_Cmd,
    [ROM_API_INDEX_SFlash_Clear_Status_Register]           = (uint32_t)SFlash_Clear_Status_Register,
    [ROM_API_INDEX_SFlash_Busy]                            = (uint32_t)SFlash_Busy,
    [ROM_API_INDEX_SFlash_Write_Enable]                    = (uint32_t)SFlash_Write_Enable,
    [ROM_API_INDEX_SFlash_Qspi_Enable]                     = (uint32_t)SFlash_Qspi_Enable,
    [ROM_API_INDEX_SFlash_Volatile_Reg_Write_Enable]       = (uint32_t)SFlash_Volatile_Reg_Write_Enable,
    [ROM_API_INDEX_SFlash_Chip_Erase]                      = (uint32_t)SFlash_Chip_Erase,
    [ROM_API_INDEX_SFlash_Sector_Erase]                    = (uint32_t)SFlash_Sector_Erase,
    [ROM_API_INDEX_SFlash_Blk32_Erase]                     = (uint32_t)SFlash_Blk32_Erase,
    [ROM_API_INDEX_SFlash_Blk64_Erase]                     = (uint32_t)SFlash_Blk64_Erase,
    [ROM_API_INDEX_SFlash_Erase]                           = (uint32_t)SFlash_Erase,
    [ROM_API_INDEX_SFlash_Program]                         = (uint32_t)SFlash_Program,
    [ROM_API_INDEX_SFlash_GetUniqueId]                     = (uint32_t)SFlash_GetUniqueId,
    [ROM_API_INDEX_SFlash_GetJedecId]                      = (uint32_t)SFlash_GetJedecId,
    [ROM_API_INDEX_SFlash_GetDeviceId]                     = (uint32_t)SFlash_GetDeviceId,
    [ROM_API_INDEX_SFlash_Powerdown]                       = (uint32_t)SFlash_Powerdown,
    [ROM_API_INDEX_SFlash_Releae_Powerdown]                = (uint32_t)SFlash_Releae_Powerdown,
    [ROM_API_INDEX_SFlash_Restore_From_Powerdown]          = (uint32_t)SFlash_Restore_From_Powerdown,
    [ROM_API_INDEX_SFlash_SetBurstWrap]                    = (uint32_t)SFlash_SetBurstWrap,
    [ROM_API_INDEX_SFlash_DisableBurstWrap]                = (uint32_t)SFlash_DisableBurstWrap,
    [ROM_API_INDEX_SFlash_Software_Reset]                  = (uint32_t)SFlash_Software_Reset,
    [ROM_API_INDEX_SFlash_Reset_Continue_Read]             = (uint32_t)SFlash_Reset_Continue_Read,
    [ROM_API_INDEX_SFlash_Set_IDbus_Cfg]                   = (uint32_t)SFlash_Set_IDbus_Cfg,
    [ROM_API_INDEX_SFlash_IDbus_Read_Enable]               = (uint32_t)SFlash_IDbus_Read_Enable,
    [ROM_API_INDEX_SFlash_Cache_Read_Enable]               = (uint32_t)SFlash_Cache_Read_Enable,
    [ROM_API_INDEX_SFlash_Cache_Read_Disable]              = (uint32_t)SFlash_Cache_Read_Disable,
    [ROM_API_INDEX_SFlash_Read]                            = (uint32_t)SFlash_Read,

    [ROM_API_INDEX_UART_SetBaudRate]                       = (uint32_t)UART_SetBaudRate,
    [ROM_API_INDEX_UART_Init]                              = (uint32_t)UART_Init,
    [ROM_API_INDEX_UART_DeInit]                            = (uint32_t)UART_DeInit,
    [ROM_API_INDEX_UART_FifoConfig]                        = (uint32_t)UART_FifoConfig,
    [ROM_API_INDEX_UART_Enable]                            = (uint32_t)UART_Enable,
    [ROM_API_INDEX_UART_Disable]                           = (uint32_t)UART_Disable,
    [ROM_API_INDEX_UART_SetTxDataLength]                   = (uint32_t)UART_SetTxDataLength,
    [ROM_API_INDEX_UART_SetRxDataLength]                   = (uint32_t)UART_SetRxDataLength,
    [ROM_API_INDEX_UART_SetRxTimeoutValue]                 = (uint32_t)UART_SetRxTimeoutValue,
    [ROM_API_INDEX_UART_SetRxByteCount]                    = (uint32_t)UART_SetRxByteCount,
    [ROM_API_INDEX_UART_SetDeglitchCount]                  = (uint32_t)UART_SetDeglitchCount,
    [ROM_API_INDEX_UART_ApplyAbrResult]                    = (uint32_t)UART_ApplyAbrResult,
    [ROM_API_INDEX_UART_SetRtsValue]                       = (uint32_t)UART_SetRtsValue,
    [ROM_API_INDEX_UART_ClrRtsValue]                       = (uint32_t)UART_ClrRtsValue,
    [ROM_API_INDEX_UART_SetTxValue]                        = (uint32_t)UART_SetTxValue,
    [ROM_API_INDEX_UART_ClrTxValue]                        = (uint32_t)UART_ClrTxValue,
    [ROM_API_INDEX_UART_TxFreeRun]                         = (uint32_t)UART_TxFreeRun,
    [ROM_API_INDEX_UART_AutoBaudDetection]                 = (uint32_t)UART_AutoBaudDetection,
    [ROM_API_INDEX_UART_SetAllowableError0X55]             = (uint32_t)UART_SetAllowableError0X55,
    [ROM_API_INDEX_UART_GetBitWidth0X55]                   = (uint32_t)UART_GetBitWidth0X55,
    [ROM_API_INDEX_UART_SetRS485]                          = (uint32_t)UART_SetRS485,
    [ROM_API_INDEX_UART_TxFifoClear]                       = (uint32_t)UART_TxFifoClear,
    [ROM_API_INDEX_UART_RxFifoClear]                       = (uint32_t)UART_RxFifoClear,
    [ROM_API_INDEX_UART_IntMask]                           = (uint32_t)UART_IntMask,
    [ROM_API_INDEX_UART_IntClear]                          = (uint32_t)UART_IntClear,
    [ROM_API_INDEX_UART_SendData]                          = (uint32_t)UART_SendData,
    [ROM_API_INDEX_UART_SendDataBlock]                     = (uint32_t)UART_SendDataBlock,
    [ROM_API_INDEX_UART_ReceiveData]                       = (uint32_t)UART_ReceiveData,
    [ROM_API_INDEX_UART_GetAutoBaudCount]                  = (uint32_t)UART_GetAutoBaudCount,
    [ROM_API_INDEX_UART_GetRxByteCount]                    = (uint32_t)UART_GetRxByteCount,
    [ROM_API_INDEX_UART_GetTxFifoCount]                    = (uint32_t)UART_GetTxFifoCount,
    [ROM_API_INDEX_UART_GetRxFifoCount]                    = (uint32_t)UART_GetRxFifoCount,
    [ROM_API_INDEX_UART_GetIntStatus]                      = (uint32_t)UART_GetIntStatus,
    [ROM_API_INDEX_UART_GetTxBusBusyStatus]                = (uint32_t)UART_GetTxBusBusyStatus,
    [ROM_API_INDEX_UART_GetRxBusBusyStatus]                = (uint32_t)UART_GetRxBusBusyStatus,
    [ROM_API_INDEX_UART_GetOverflowStatus]                 = (uint32_t)UART_GetOverflowStatus,

