bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romdriver.c
    [ROM_API_INDEX_XIP_SFlash_Opt_Enter]                   = (uint32_t)XIP_SFlash_Opt_Enter,
    [ROM_API_INDEX_XIP_SFlash_Opt_Exit]                    = (uint32_t)XIP_SFlash_Opt_Exit,
    [ROM_API_INDEX_XIP_SFlash_State_Save]                  = (uint32_t)XIP_SFlash_State_Save,
    [ROM_API_INDEX_XIP_SFlash_State_Restore]               = (uint32_t)XIP_SFlash_State_Restore,
    [ROM_API_INDEX_XIP_SFlash_Erase_Need_Lock]             = (uint32_t)XIP_SFlash_Erase_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Write_Need_Lock]             = (uint32_t)XIP_SFlash_Write_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Read_Need_Lock]              = (uint32_t)XIP_SFlash_Read_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_GetJedecId_Need_Lock]        = (uint32_t)XIP_SFlash_GetJedecId_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_GetDeviceId_Need_Lock]       = (uint32_t)XIP_SFlash_GetDeviceId_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_GetUniqueId_Need_Lock]       = (uint32_t)XIP_SFlash_GetUniqueId_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Read_Via_Cache_Need_Lock]    = (uint32_t)XIP_SFlash_Read_Via_Cache_Need_Lock,
    [ROM_API_INDEX_XIP_SFlash_Clear_Status_Register_Need_Lock]= (uint32_t)XIP_SFlash_Clear_Status_Register_Need_Lock,

    [ROM_API_INDEX_IR_TxInit]                              = (uint32_t)IR_TxInit,
    [ROM_API_INDEX_IR_TxPulseWidthConfig]                  = (uint32_t)IR_TxPulseWidthConfig,
    [ROM_API_INDEX_IR_FifoConfig]                          = (uint32_t)IR_FifoConfig,
    [ROM_API_INDEX_IR_DeInit]                              = (uint32_t)IR_DeInit,
    [ROM_API_INDEX_IR_Enable]                              = (uint32_t)IR_Enable,
    [ROM_API_INDEX_IR_Disable]                             = (uint32_t)IR_Disable,
    [ROM_API_INDEX_IR_TxSWM]                               = (uint32_t)IR_TxSWM,
    [ROM_API_INDEX_IR_TxFifoClear]                         = (uint32_t)IR_TxFifoClear,
    [ROM_API_INDEX_IR_SendData]                            = (uint32_t)IR_SendData,
    [ROM_API_INDEX_IR_SWMSendData]                         = (uint32_t)IR_SWMSendData,
    [ROM_API_INDEX_IR_SendCommand]                         = (uint32_t)IR_SendCommand,
    [ROM_API_INDEX_IR_SWMSendCommand]                      = (uint32_t)IR_SWMSendCommand,
    [ROM_API_INDEX_IR_SendNEC]                             = (uint32_t)IR_SendNEC,
    [ROM_API_INDEX_IR_IntMask]                             = (uint32_t)IR_IntMask,
    [ROM_API_INDEX_IR_ClrIntStatus]                        = (uint32_t)IR_ClrIntStatus,
    [ROM_API_INDEX_IR_GetIntStatus]                        = (uint32_t)IR_GetIntStatus,
    [ROM_API_INDEX_IR_GetFifoStatus]                       = (uint32_t)IR_GetFifoStatus,
    [ROM_API_INDEX_IR_GetTxFifoCount]                      = (uint32_t)IR_GetTxFifoCount,
    [ROM_API_INDEX_IR_LEDInit]                             = (uint32_t)IR_LEDInit,
    [ROM_API_INDEX_IR_LEDSend]                             = (uint32_t)IR_LEDSend,

    [ROM_API_INDEX_KYS_Init]                               = (uint32_t)KYS_Init,
    [ROM_API_INDEX_KYS_Enable]                             = (uint32_t)KYS_Enable,
    [ROM_API_INDEX_KYS_Disable]                            = (uint32_t)KYS_Disable,
    [ROM_API_INDEX_KYS_IntMask]                            = (uint32_t)KYS_IntMask,
    [ROM_API_INDEX_KYS_IntClear]                           = (uint32_t)KYS_IntClear,
    [ROM_API_INDEX_KYS_GetIntStatus]                       = (uint32_t)KYS_GetIntStatus,
    [ROM_API_INDEX_KYS_Get_FIFO_Idx]                       = (uint32_t)KYS_Get_FIFO_Idx,
    [ROM_API_INDEX_KYS_ReadKeyfifo]                        = (uint32_t)KYS_ReadKeyfifo,

    [ROM_API_INDEX_Psram_Init]                             = (uint32_t)Psram_Init,
    [ROM_API_INDEX_Psram_ReadReg]                          = (uint32_t)Psram_ReadReg,
    [ROM_API_INDEX_Psram_WriteReg]                         = (uint32_t)Psram_WriteReg,
    [ROM_API_INDEX_Psram_SetDriveStrength]                 = (uint32_t)Psram_SetDriveStrength,
    [ROM_API_INDEX_Psram_SetBurstWrap]                     = (uint32_t)Psram_SetBurstWrap,
    [ROM_API_INDEX_Psram_ReadId]                           = (uint32_t)Psram_ReadId,
    [ROM_API_INDEX_Psram_EnterQuadMode]                    = (uint32_t)Psram_EnterQuadMode,
    [ROM_API_INDEX_Psram_ExitQuadMode]                     = (uint32_t)Psram_ExitQuadMode,
    [ROM_API_INDEX_Psram_ToggleBurstLength]                = (uint32_t)Psram_ToggleBurstLength,
    [ROM_API_INDEX_Psram_SoftwareReset]                    = (uint32_t)Psram_SoftwareReset,
    [ROM_API_INDEX_Psram_Set_IDbus_Cfg]                    = (uint32_t)Psram_Set_IDbus_Cfg,
    [ROM_API_INDEX_Psram_Cache_Write_Set]                  = (uint32_t)Psram_Cache_Write_Set,
    [ROM_API_INDEX_Psram_Write]                            = (uint32_t)Psram_Write,
    [ROM_API_INDEX_Psram_Read]                             = (uint32_t)Psram_Read,

    [ROM_API_INDEX_TIMER_GetCompValue]                     = (uint32_t)TIMER_GetCompValue,
    [ROM_API_INDEX_TIMER_SetCompValue]                     = (uint32_t)TIMER_SetCompValue,
    [ROM_API_INDEX_TIMER_CompValueEffectImmediately]       = (uint32_t)TIMER_CompValueEffectImmediately,
    [ROM_API_INDEX_TIMER_GetCounterValue]                  = (uint32_t)TIMER_GetCounterValue,
    [ROM_API_INDEX_TIMER_ResetCounterValue]                = (uint32_t)TIMER_ResetCounterValue,
    [ROM_API_INDEX_TIMER_GetMatchStatus]                   = (uint32_t)TIMER_GetMatchStatus,
    [ROM_API_INDEX_TIMER_GetPreloadValue]                  = (uint32_t)TIMER_GetPreloadValue,
    [ROM_API_INDEX_TIMER_SetPreloadValue]                  = (uint32_t)TIMER_SetPreloadValue,
    [ROM_API_INDEX_TIMER_SetPreloadTrigSrc]                = (uint32_t)TIMER_SetPreloadTrigSrc,
    [ROM_API_INDEX_TIMER_SetCountMode]                     = (uint32_t)TIMER_SetCountMode,
    [ROM_API_INDEX_TIMER_ClearIntStatus]                   = (uint32_t)TIMER_ClearIntStatus,
    [ROM_API_INDEX_TIMER_Init]                             = (uint32_t)TIMER_Init,
    [ROM_API_INDEX_TIMER_DeInit]                           = (uint32_t)TIMER_DeInit,
    [ROM_API_INDEX_TIMER_Enable]                           = (uint32_t)TIMER_Enable,
    [ROM_API_INDEX_TIMER_Disable]                          = (uint32_t)TIMER_Disable,
    [ROM_API_INDEX_TIMER_IntMask]                          = (uint32_t)TIMER_IntMask,
    [ROM_API_INDEX_TIMER_GPIOSetPolarity]                  = (uint32_t)TIMER_GPIOSetPolarity,
    [ROM_API_INDEX_TIMER_CH0_SetMeasurePulseWidth]         = (uint32_t)TIMER_CH0_SetMeasurePulseWidth,
    [ROM_API_INDEX_TIMER_CH0_GetMeasurePulseWidth]         = (uint32_t)TIMER_CH0_GetMeasurePulseWidth,
    [ROM_API_INDEX_TIMER_ForceClockDivision]               = (uint32_t)TIMER_ForceClockDivision,

