bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/src/bl702l_romdriver.c
    [ROM_API_INDEX_WDT_Set_Clock]                          = (uint32_t)WDT_Set_Clock,
    [ROM_API_INDEX_WDT_GetMatchValue]                      = (uint32_t)WDT_GetMatchValue,
    [ROM_API_INDEX_WDT_SetCompValue]                       = (uint32_t)WDT_SetCompValue,
    [ROM_API_INDEX_WDT_CompValueEffectImmediately]         = (uint32_t)WDT_CompValueEffectImmediately,
    [ROM_API_INDEX_WDT_GetCounterValue]                    = (uint32_t)WDT_GetCounterValue,
    [ROM_API_INDEX_WDT_ResetCounterValue]                  = (uint32_t)WDT_ResetCounterValue,
    [ROM_API_INDEX_WDT_GetResetStatus]                     = (uint32_t)WDT_GetResetStatus,
    [ROM_API_INDEX_WDT_ClearResetStatus]                   = (uint32_t)WDT_ClearResetStatus,
    [ROM_API_INDEX_WDT_Enable]                             = (uint32_t)WDT_Enable,
    [ROM_API_INDEX_WDT_Disable]                            = (uint32_t)WDT_Disable,
    [ROM_API_INDEX_WDT_ForceClockDivision]                 = (uint32_t)WDT_ForceClockDivision,
    [ROM_API_INDEX_WDT_IntMask]                            = (uint32_t)WDT_IntMask,
    [ROM_API_INDEX_WDT_GPIOSetPolarity]                    = (uint32_t)WDT_GPIOSetPolarity,

    [ROM_API_INDEX_arch_memcpy]                            = (uint32_t)arch_memcpy,
    [ROM_API_INDEX_arch_memcpy4]                           = (uint32_t)arch_memcpy4,
    [ROM_API_INDEX_arch_memcpy_fast]                       = (uint32_t)arch_memcpy_fast,
    [ROM_API_INDEX_arch_memset]                            = (uint32_t)arch_memset,
    [ROM_API_INDEX_arch_memset4]                           = (uint32_t)arch_memset4,
    [ROM_API_INDEX_arch_memcmp]                            = (uint32_t)arch_memcmp,

    [ROM_API_INDEX_memcopy_to_fifo]                        = (uint32_t)memcopy_to_fifo,

    [ROM_API_INDEX_fifocopy_to_mem]                        = (uint32_t)fifocopy_to_mem,

    [ROM_API_INDEX_BFLB_Soft_CRC32_Ex]                     = (uint32_t)BFLB_Soft_CRC32_Ex,
    [ROM_API_INDEX_BFLB_Soft_CRC32]                        = (uint32_t)BFLB_Soft_CRC32,

    [ROM_API_INDEX_FUNC_EMPTY_START ... ROM_API_INDEX_FUNC_EMPTY_END] = 0xdeedbeef,
};


/*@} end of group ROMDRIVER_Global_Variables */

/** @defgroup ROMDRIVER_Private_FunctionDeclaration
 *  @{
 */

/*@} end of group ROMDRIVER_Private_FunctionDeclaration */

/** @defgroup ROMDRIVER_Private_Functions
 *  @{
 */

/*@} end of group ROMDRIVER_Private_Functions */

/** @defgroup ROMDRIVER_Public_Functions
 *  @{
 */

/*@} end of group ROMDRIVER_Public_Functions */

/*@} end of group ROMDRIVER_COMMON */

/*@} end of group BL702L_Periph_Driver */


